app/views/posts/_post.html.erb

		<div class="panel-body">
			<div style="color: #3BB2D6;"><%= time_ago_in_words(post.created_at) %></div>
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "anjan"], ["content", "std"], ["created_at", "2016-03-31 11:57:42.675268"], ["updated_at", "2016-03-31 11:57:42.675268"]]