app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdf"], ["content", "sfas"], ["created_at", "2016-03-31 09:35:50.499488"], ["updated_at", "2016-03-31 09:35:50.499488"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "b"], ["content", "a"], ["updated_at", "2016-04-01 06:47:12.590217"], ["id", 25]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)